package CycleWhile;

import java.util.Scanner;

public class Task2 {

    public static void main(String[] args) {

        // Задача 2: Сумма чисел от 1 до N
        // Напишите программу, которая вычисляет сумму всех чисел от 1 до заданного числа N.

        Scanner scanner = new Scanner(System.in);

        System.out.println("Введите число N: ");
        int number = scanner.nextInt();

        int totalSum = 0;




    }
}
