package Cycles;

import java.util.Scanner;

public class Task8 {

    public static void main(String[] args) {

        // Задача 8: Таблица квадратов
        // Напишите программу, которая выводит таблицу квадратов чисел от 1 до 10.

        for (int i = 1; i <= 10; i ++) {
            System.out.println(i*i);
        }


    }
}
