package Cycles;

import java.util.Scanner;

public class Task7 {

    public static void main(String[] args) {

        // Задача 8. Поиск минимального и максимального значения
        //Напишите программу, которая принимает n целых чисел и находит минимальное и максимальное значение среди них.


        Scanner scanner = new Scanner(System.in);
        System.out.println("Введите число n: ");
        int number = scanner.nextInt();

        if (number < 0) {
            System.out.println("Число не положительное.");
        }



    }
}
